// Выражение – это фраза языка программирования JavaScript, которая может быть вычислена интерпретатором для получения значения.

// Операторы объединяют значения своих операндов и вычисляют новое значение. Самый простой пример – оператор +.

// Выражение a + b вычисляет сумму выражений a и b.

// Простейшие выражения называют первичными выражениями. Они являются самостоятельными выражениями и они не включают более простых выражений.

// Первичными выражениями в JavaScript являются константы, или литералы, ключевые слова и ссылки на переменные.

// Операторы используются и в арифметических выражениях, и выражениях сравнения, и в логических выражениях:
// 1. Инкремент (++)
// 2. Декремент (--)
// 3. Минус (-)
// 4. Плюс (+)
// 5. Поразрядная инверсия (~)
// 6. Логическая инверсия (!)
// 7. Удаление свойств (delete)
// 8. Определение типа операнда (typeof)
// 9. Возврат неопределенного значения (void)
// 11. Сдвиг влево (<<)
// 12. Сдвиг вправо с сохранением знака (>>)
// 13. Сдвиг вправо с заполнением нулями (>>>)
// 14. Сравнение чисел и строк (< <= > >=)
// 15. Проверка на принадлежность классу (instanceof)
// 16. Проверка наличия свойства (in)
// 17. Проверка равенства без учета принадлежности типу данных (==)
// 18. Проверка неравенства без учета принадлежности типу данных (!=)
// 19. Проверка равенства с учетом принадлежности типу данных (===)
// 20. Проверка неравенства с учетом принадлежности типу данных (!==)
// 21. Поразрядное И (&)
// 22. Поразрядное ИСКЛЮЧАЮЩЕЕ ИЛИ (^)
// 23. Логическое И (&&)
// 24. Логическое ИЛИ (||)
// 25. Выбор второго или третьего операнда (тернарный оператор) (?:)
// 26. Присваивание (=)
// 27. Операции с присваиванием (+= -= *= /= %= ^= |= и т.д.)

