// 2.10  Философия React

// Философия реакт - это отличный способ писать большие и быстрые JavaScript-приложения, он хорошо масштабируется.

// Одна из особенностей React — это предлагаемый им процесс мышления при создании приложений. Макет: Разобьём интерфейс на составляющие > Создадим статическое приложение > Определим минимальное (но полноценное) отображение состояния интерфейса > Определим, где должно находиться наше состояние > Добавим обратный поток данных

// React — это декларативная, JavaScript библиотека для создания пользовательских интерфейсов. Она позволяет вам собирать сложный UI из маленьких изолированных кусочков кода «компонентами».

// React исходит из принципа, что логика рендеринга неразрывно связана с прочей логикой UI: с тем, как обрабатываются события, как состояние изменяется во времени и как данные готовятся к отображению.

// Главные особености:
// Используем React с JSX
// Mодульный, прямолинейный код и повторно используемые компоненты.